#### Terraform Format `success`
<details><summary>Output</summary>
```


```
</details>

#### Terraform Iniz `success`
<details><summary>Output</summary>
```


Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of cloudflare/cloudflare from the dependency lock file
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v4.11.0...
- Installed hashicorp/aws v4.11.0 (signed by HashiCorp)
- Installing cloudflare/cloudflare v3.13.0...
- Installed cloudflare/cloudflare v3.13.0 (signed by a HashiCorp partner, key ID DE413CEC881C3283)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has made some changes to the provider dependency selections recorded
in the .terraform.lock.hcl file. Review those changes and commit them to your
version control system if they represent changes you intended to make.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```
</details>

#### Terraform Validation `success`
<details><summary>Output</summary>
```

Success! The configuration is valid.


```
</details>

#### Terraform Plan `success`
<details><summary>Output</summary>
```

cloudflare_zone.gopad: Refreshing state... [id=af26f110aba5bd79176147dc3dbc3511]
cloudflare_record.root: Refreshing state... [id=a4df1bd2e41ab73009055cae03420e1f]
cloudflare_record.www: Refreshing state... [id=415e93d3c92e25bf9e5019b9ffe1e067]
aws_s3_bucket.download: Refreshing state... [id=dl.gopad.eu]
aws_s3_bucket_website_configuration.download: Refreshing state... [id=dl.gopad.eu]
cloudflare_record.download: Refreshing state... [id=8c7a6c57f61f27e1d8ac8822448dbd65]
aws_s3_bucket_cors_configuration.download: Refreshing state... [id=dl.gopad.eu]
aws_s3_object.download: Refreshing state... [id=index.html]
aws_s3_bucket_policy.download: Refreshing state... [id=dl.gopad.eu]
aws_s3_bucket_acl.download: Refreshing state... [id=dl.gopad.eu,public-read]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.github will be created
  + resource "cloudflare_record" "github" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_github-challenge-gopad-organization"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "TXT"
      + value           = "3a52d62106"
      + zone_id         = "af26f110aba5bd79176147dc3dbc3511"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pusher: @tboerger, Action: `pull_request`*